/*자바스크립트란 웹페이지의 동적인 기능을 구현하기 위해 만들어진 언어입니다  */


console.log();
/* 콘솔 화면에 메세지를 출력한다 */ 

alert
/* 브라우저에 경고창을 띄운다 */ 


/* 숫자표현 - 1234
   문자표현 -  ' 안녕하세요' 
   명령문 끝 - 세미콜론; 을 붙여줘여한다
   
   
   변수 - 다양한 값을 넣는 박스 역할
   
   let name = "전현우";
   let은 예약어(키워드)라고 불리며 문법적인 용도로 사용되고 있기 때문에 식별자로 사용할 수 없다  let , const, function 등 많은 예약어가있다
    name은 식별자라고 불리며 이름을 붙일때 사용한다
    
    
    함수
    - 코드를 편하게 사용하게 위해 그룹화한 것을 말한다 / 그룹화 한후 실행문으로 바로 실행 가능
    
    객체
    -변수와 함수를 가진다 / 객체 안에 쓰이는 변수를 프로퍼티(속성)이라고 한다 / 객체 안에 쓰이는 함수를 매서드 라고한다
    
    이벤트 
    - HTML 요소에서 발생한 사건
    
    상수 
    - 변수와 마찬가지로 값을 담지만 할당된 값을 바꿀 수 없다
    - 상수를 선언할 떄는 const 라는 키워드를 사용한다
    */ 
   const today = "목요일";
   console.log(today);
   /*  today = "목요일"; 이라는 상수값을 변경할 수 없다    */